app/Controllers/Empleados.php

SELECT *
FROM `departamentos`
---
    public function new()
    {
        $departamentosModel = new DepartamentosModel();
        $data['departamentos']= $departamentosModel->findAll();

INSERT INTO `empleados` (`clave`, `nombre`, `fecha_nacimiento`, `telefono`, `email`, `id_departamento`, `created_at`, `updated_at`) VALUES ('111111', 'kilmar', '2024-02-02', '71828718', 'qahjs@jhaj.com', '1', '2024-02-02 06:12:44', '2024-02-02 06:12:44')
---
    public function create()
    {
        $reglas = [
            'clave' => 'required|min_length[5]|max_length[10]|is_unique[empleados.clave]',
            'nombre' => 'required',
            'fecha_nacimiento' => 'required',
            'telefono' => 'required',
            'email' => 'required|valid_email',
            'departamento' => 'required|is_not_unique[departamentos.id]',
        ];

        if(!$this->validate($reglas)){
            return redirect()->back()->withInput()->with('error', $this->validator->listErrors());
        }

        $post =  $this->request->getPost(['clave','nombre','fecha_nacimiento','telefono','email','departamento']);
        $departamentosModel = new EmpleadosModel();
        $departamentosModel->insert([
            'clave' => trim($post['clave']),
            'nombre' => trim($post['nombre']),
            'fecha_nacimiento' => trim($post['fecha_nacimiento']),
            'telefono' => trim($post['telefono']),
            'email' => trim($post['email']),
            'id_departamento' => trim($post['departamento']),

        ]);

SELECT *
FROM `departamentos`
SELECT *
FROM `empleados`
WHERE `empleados`.`id` = '4'
---
    public function edit($id = null)
    {
        if ($id == null) {
            return redirect()->to('empleados');
        }

        $empleadosModel = new EmpleadosModel();
        $departamentosModel = new DepartamentosModel();

        $data['departamentos']= $departamentosModel->findAll();
        $data['empleado']= $empleadosModel->find($id);