app/Models/EmpleadosModel.php

SELECT `empleados`.*, `departamentos`.`nombre` AS `departamento`
FROM `empleados`
JOIN `departamentos` ON `empleados`.`id_departamento` = `departamentos`.`id`
---
    public function empleadosDepartamento(){
        return $this->select('empleados.*, departamentos.nombre AS departamento')
        ->join('departamentos', 'empleados.id_departamento = departamentos.id')
        ->findAll();